/*******************************************************************************
  * @file                   pid.c
  * @Author:                MQjehovah                 mail:MQjehovah@hotmail.com
  * @version                1.0.0
  * @date                   2016.5.24
  * @brief					PID控制
  ******************************************************************************
  * @attention
*******************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include "pid.h"
/* Definition ----------------------------------------------------------------*/

/* Functions -----------------------------------------------------------------*/
PID_TYPE PID;
/*******************************************************************************
  * @brief  PID_Calc
  * @param  None
  * @retval None
  * @Note   pid输出计算
*******************************************************************************/
int PID_Calc(int cur_err)
{
	//double timeChange = 1;//1ms									//pid计算时间间隔 这里为1ms，视为时间单位省略
	//计算PID误差
    PID.eP = cur_err;												//反馈值与输入值的差值 e(t) = 比例
    PID.eI+= PID.eP;                      							//差值*时间间隔乘积累加 = 积分  理论是零
    PID.eD = PID.eP - PID.lastErr;       							//差值-上一次差值 = 微分           
    PID.OUT = PID.kP * PID.eP + PID.kI * PID.eI + PID.kD * PID.eD;	//输出 = 比例 + 积分 + 微分  
    PID.lastErr = PID.eP;                                   		//下次循环: 当前比例成为过去比例
	return PID.OUT;
}

#endif
/*********************************END OF FILE**********************************/
